// Schema template [45][22]
// (Strings because it is simpler to read)
String[] schema = {
"000000000000000000101010101000000000000000000",
"000000000000000000000000000000000000000000000",
"000000000000000000000010000000000000000000000",
"000000000000000000000000000000000000000000000",
"000000000011111000111101111000111110000000000",
"000000000111110001111101111100011111000000000",
"000000111111000111111101111111000111111000000",
"000001111110001111111101111111100011111100000",
"000011111100011111111101111111110001111110000",
"001111110001111100111101111001111100011111101",
"001111100111111001111101111100111111001111101",
"001110000111111001111101111100111111000011101",
"001100011111110011111101111110011111110001101",
"000000000000000000000000000000000000000000000",
"100000111111100111111101111111001111111000001",
"100011111111001111111101111111100111111110001",
"100001111111001111111101111111100111111100001",
"000001111110011111111101111111110011111100001",
"000000001100111111111101111111111001100000000",
"000000000000011111111101111111110000000000000",
"000111111100000000000000000000000001111111000",
"000111111100000011110000011110000001111111000"
};

/*
rada #1 - 436
_________
rada #2 -

27 Фракция Народный Рух Украины
84 Фракция Коммунистической партии Украины
25 Фракция Социалистической партии Украины (до 1998 года)
Фракция Селянской партии Украины (1995-03.10.1996)
Группа «Аграрники Украины» (до 1995 года, с 03.10.1996)
Группа «Аграрники за реформы» (1995-03.10.1996)
Фракция Аграрная партия Украины (в 1998 году)
Межрегиональная депутатская группа (до 1998 года)
Фракция Партии регионального возрождения Украины (в 1998 году)
Группа «Социально-рыночный выбор» (в 1996—1998 годах)
Группа «Державність» («Государственность») (1994-12.09.1996), председатель — И. Юхновский
Группа «Центр» (22.04.1994-12.09.1996)
Группа «Конституционный Центр» (12.09.1996-1998)
Группа «Реформы» (в 1994—1997 годах), председатель — В. Лановой
Группа «Единство», 34 народных депутата
Группа «Вперёд, Украина!» (в 1998 году)
Группа «Независимые» (в 1995—1998 годах)
_________
rada #3

#ff0000
Комуністична партія України
123

#ffff00
Народний рух України
46

#ffc0cb
Виборчий блок Соціалістичної партії України та Селянської партії України «За правду, за народ, за Україну!»
35

#90ee90
Партія зелених України
19

#f5deb3
Народно-демократична партія
28

#800080
Всеукраїнське об'єднання «Громада»
18

#a52a2a
Прогресивна соціалістична партія України
16

#00ffff
Соціал-демократична партія України (об'єднана)
17

#ffd700
Виборчий блок партій «Національний фронт»
6

#40e0d0
Партія «Реформи і порядок»
3

#008000
Аграрна партія України
2

#ffffff
Виборчий блок партій «Партія праці та Ліберальна партія – РАЗОМ»
2

#ffa500
Виборчий блок партій «Блок Демократичних партій – НЕП (народовладдя, економіка, порядок)»
2

#4b0082
Християнсько-демократична партія України
2

#800000
Партія «Демократичний союз»
0

#ffffff
Інші партії і блоки
5

#808080
Самовисуванці
120

_________
rada #4

#0000ff
«За единую Украину!»
175

#f0b86e
«Блок «Наша Украина»
119

#ff6600
«Коммунистическая партия Украины»
65

#ffc0cb
Блок Юлии Тимошенко
23

#e03d89
«Социалистическая партия Украины»
22

#9574a8
Социал-демократическая партия Украины (объединённая)
31

#000000
Внефракционные депутаты
12

_________
rada #5

#0000ff
Партія регіонів
189

#800080
Блок Юлії Тимошенко
129

#ffff00
Блок «Наша Україна»
81

#ffc0cb
Соціалістична партія України
33

#ff0000
Комуністична партія України
21
_________
rada #6

#0000ff
«Партия регионов»
175

#ffc0cb
«Блок Юлии Тимошенко»
156

#f0b86e
«Блок Наша Украина-Народная самооборона»
72

#ff6600
«Коммунистическая партия Украины»
27

#e6e6b8
Блок Владимира Литвина
20

_________
rada #7

#800040
ВО «Батькивщина»
86

#2828ff
«Партия регионов»
78

#9c4b1c
«УДАР (Украинский демократический альянс за реформы)»
41

#66ccff
«Экономическое развитие»
41

#ffff00
ВО «Свобода»
35

#1bd216
«Суверенная европейская Украина»
35

#126180
«За мир и стабильность»
34

#808080
Внефракционные депутаты
95
_________
rada #7/1

#2828ff
«Партия регионов»
205

#800040
ВО «Батькивщина»
89

#9c4b1c
«УДАР (Украинский демократический альянс за реформы) Виталия Кличко»
42

#ffff00
ВО «Свобода»
36

#ff0000
«Коммунистическая партия Украины»
32

#808080
Внефракционные депутаты
43

_________
rada #7/2

#2828ff
«Партия регионов»
187

#800040
ВО «Батькивщина»
102

#9c4b1c
«УДАР (Украинский демократический альянс за реформы)»
40

#ffff00
ВО «Свобода»
38

#ff0000
«Коммунистическая партия Украины»
32

#6e006e
Единый Центр
3

#e6e6b8
Народная партия
2

#ff9999
Радикальная партия Олега Ляшко
1

#66ccff
Союз
1

#808080
Самовыдвиженцы
44

_________
rada #8

#ed9121
«Блок Петра Порошенко»
141

#f6cf49
«Народный фронт»
79

#264798
Оппозиционный блок
43

#0b5226
«Самопомощь»
26

#ffd700
Радикальная партия Олега Ляшко
21

#e45395
Батькивщина
19

#66ccff
Возрождение
23

#00b669
«Воля народа»
19

#9f9f9f
Внефракционные депутаты
42
 */
